docs/eventos_timer.reveal.html
<!DOCTYPE html><html lang="es"><head><meta charset="utf-8"><title>Eventos y temporizadores</title><meta name="author" content="Carlos León"><link rel="stylesheet" href="tooling.reveal.e38fa0d8.css"><link rel="stylesheet" href="tooling.reveal.a866bf8d.css" id="theme"><link rel="stylesheet" href="tooling.reveal.c1a625de.css"><link rel="stylesheet" href="tooling.reveal.fdb16a0d.css"></head><body> <div class="reveal"> <div class="slides"> <section id="sec-title-slide"> <h1 class="title">Eventos y temporizadores</h1><h2 class="author">Carlos León</h2><h2 class="email"><a href="mailto:cleon@fedora">cleon@fedora</a></h2> </section> <section> <section id="slide-eventos"> <h2 id="eventos">Eventos</h2> </section> <section> <p> Parte de la ejecución de Phaser está dirigida por <b>eventos</b> </p> <p> Un evento es un aviso de que algo ha ocurrido </p> <p> Creamos <b>callbacks</b> o funciones que se ejecutarán en respuesta a estos eventos </p> </section> <section id="slide-algunos-eventos-en-phaser"> <h3 id="algunos-eventos-en-phaser">Algunos eventos en Phaser</h3> <ul> <li>Input: Teclado (<code>'down'</code>, <code>'up'</code>&#x2026;), ratón (<code>'pointerdown'</code>, <code>'wheel'</code>&#x2026;)</li> <li>Física en Arcade: <code>'collider'</code>, <code>'overlap'</code>&#x2026;</li> <li>Física en Matter: <code>'collisionstart'</code>, <code>'collisionend'</code></li> <li>Animaciones de sprites: <code>'animationrepeat'</code>, <code>'animationcomplete'</code>&#x2026;</li> <li>Sonido: <code>'stop'</code>&#x2026;</li> </ul> </section> <section> <p> Pero hay muchos más eventos en Phaser: <a href="https://newdocs.phaser.io/docs/3.55.2/events">Mirar en Events</a> </p> </section> <section id="slide-suscripción-a-eventos"> <h3 id="suscripción-a-eventos">Suscripción a eventos</h3> <p> Para responder a estos eventos nos tenemos que <b>suscribir</b> a ellos, es decir, debemos indicar qué funciones queremos que se ejecuten cuando se produzcan estos eventos. </p> </section> <section> <p> En ocasiones, no somos conscientes de esta suscripción: </p> <ul> <li><code>init</code>, <code>create</code>, <code>update</code>&#x2026; son las funciones que se ejecutarán en respuesta a los eventos del mismo nombre en la escena.</li> <li><code>add.collider</code> o <code>add.overlap</code> (al usar el motor de física de Arcade) tienen como parámetro el callback que se ejecutará en respuesta a los eventos de <code>collide</code> y <code>overlap</code></li> </ul> </section> <section> <p> En otras ocasiones, nos suscribimos mediante las funciones <code>on</code> (y nos desenganchamos usando <code>off</code>) y <code>once</code> (solo escuchamos una vez el evento): </p> <div class="org-src-container"> <pre><code class="js">// cuando se inicia la colisión
this.matter.world.on('collisionstart', 
    (evento, cuerpo1, cuerpo2) =&gt; {
    // hacer algo
});
// Suscripción a sonidos
this.explosion = scene.sound.add("explosion", config);
this.explosion.once("stop", (music) =&gt; {
    // ...
});
</code></pre> </div> </section> <section> <p> En general, la suscripción se hace <b>una sola vez</b>, generalmente en el <code>create</code> de las escenas o en el constructor de los Gameobjects. </p> <blockquote> <p> ¡Cuidado con suscripciones en el <code>update</code> (se añade una función nueva a la que llamar en cada tick)! </p> </blockquote> </section> <section id="slide-eventos-propios"> <h3 id="eventos-propios">Eventos propios</h3> <p> Podemos crear nuestros propios eventos y suscribirnos a ellos: </p> <div class="org-src-container"> <pre><code class="js">// En el create de Scene 
this.events.on('playerdead', gameOver);
...
// En otro punto de nuestro juego (this es la escena)
this.events.emit('playerdead');

function gameOver() {
    // Fin de la partida
    // Se ejecuta cuando el jugador haya muerto
}
</code></pre> </div> </section> <section> <p> Podemos enviar parámetros al emitir un evento: </p> <div class="org-src-container"> <pre><code class="js">
// enviamos las coordenadas en las que murió el jugador
this.events.emit('playerdead', this.player.x, this.player.y);

function gameOver(x, y) {
    // Fin de la partida
    // Se ejecuta cuando el jugador haya muerto
    // Recibimos las coordenadas del jugador
}
</code></pre> </div> </section> </section> <section> <section id="slide-temporizadores"> <h2 id="temporizadores">Temporizadores</h2> </section> <section> <p> Para hacer que una acción se produzca pasado un cierto tiempo usamos los <a href="https://newdocs.phaser.io/docs/3.55.2/Phaser.Time.Clock">temporizadores (o relojes) de Phaser</a> </p> <p> Crearemos un evento que se ejecute pasado un tiempo y nos suscribiremos a él </p> <blockquote> <p> ¡Cuidado, no usar los métodos del navegador <code>setTimeout</code> y <code>setInterval</code>! </p> </blockquote> </section> <section> <p> Para una acción diferida que se ejecuta una vez: </p> <div class="org-src-container"> <pre><code class="js">/// this es Scene
let timer = this.time.addEvent( {
        delay: 2000, 
        callback: onEvent,
        callbackScope: this 
});

onEvent() {
    // ejecuta algo dentro de 2000ms (2s)
}
</code></pre> </div> </section> <section> <p> Para una acción que se repite en el tiempo: </p> <div class="org-src-container"> <pre><code class="js">// this es Scene
let timer = this.time.addEvent( {
        delay: 2000, 
        callback: onEvent,
        callbackScope: this,
        loop: true
});

onEvent() {
    // ejecuta esto cada 2000ms (2s)
}

// Para dejar de usarlo
this.time.removeEvent(timer);
</code></pre> </div> </section> <section> <p> Los temporizadores se pueden detener, cambiar la escala de tiempo&#x2026; </p> <p> <a href="https://newdocs.phaser.io/docs/3.55.2/Phaser.Time.Clock">Estudiad su API</a> </p> </section> </section> </div> </div> <script src="tooling.reveal.ffb33b1a.js"></script> <script src="tooling.reveal.f05d24be.js"></script> <script src="tooling.reveal.1feea775.js"></script> <script src="tooling.reveal.d2982244.js"></script> <script>Reveal.initialize({controls:!0,progress:!0,history:!0,center:!0,slideNumber:"c",rollingLinks:!1,keyboard:!0,mouseWheel:!1,fragmentInURL:!1,hashOneBasedIndex:!1,pdfSeparateFragments:!0,overview:!0,transition:"none",transitionSpeed:"default",plugins:[RevealSearch,RevealHighlight,RevealZoom],dependencies:[]});</script> </body></html>